
Feature: Търсене на обяви

  Scenario: Търсене на обяви по съществуващо име
    Given Потребитеял отваря екрана за търсене на обяви
    When Потребителя въведе име на обява "пералня"
    And Натисне върху бутона за търсене
    Then Вижда лист с обяви със съвпадащо име.
    
    Scenario: Търсене на обяви по несъществуващо име
    Given Потребитеял отваря екрана за търсене на обяви
    When Потребителя въведе име на обява "фурна"
    And Натисне върху бутона за търсене
    Then Вижда съобщение за неуспех.
    
     Scenario: Търсене на обяви с невъведени данни
    Given Потребитеял отваря екрана за търсене на обяви
    And Натисне върху бутона за търсене
    Then Вижда съобщение за неуспех.
    
     Scenario: Търсене на обяви по дадена цена
    Given Потребитеял отваря екрана за търсене на обяви
    When Потребителя въведе цена на обявата "250"
    And Натисне върху бутона за търсене
    Then Вижда лист на обяви със въведената цена.
    
     Scenario: Търсене на обяви по име и цена
    Given Потребитеял отваря екрана за търсене на обяви
    When Потребителя въведе име на обява "пералня"
    When Потребителя въведе цена на обявата "250"
    And Натисне върху бутона за търсене
    Then Вижда лист на обяви по въведените име и цена.
    
    
    