
Feature: Вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    Given Потребитеял отваря екрана за вход в системата
    When Потребителя въведе потребителско име "Ivan"
    And Въведе парола "Pass123!"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение за успех.
    
  Scenario: Вход в системата с невалидни потребителски данни
    Given Потребитеял отваря екрана за вход в системата
    When Потребителя въведе потребителско име "Ivan12"
    And Въведе парола "123Pass4"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение за грешни потребителски данни.
    
  Scenario: Вход в системата без парола
    Given Потребитеял отваря екрана за вход в системата
    When Потребителя въведе потребителско име "Ivan12"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение въведете парола.
    
  Scenario: Вход в системата без потребителско име
    Given Потребитеял отваря екрана за вход в системата
    When Въведе парола "123Pass4"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение въведете потребителско име.
    
  Scenario: Вход в системата без потребителски данни
    Given Потребитеял отваря екрана за вход в системата
    When Натисне върху бутона за вход в системата
    Then Вижда съобщение въведете потребителски данни.
    
    
    
    